
export const productsData = [
    {
        "id": "1",
        "category": "Мед",
        "image": "МедАкацієвий-desktop.jpeg",
        "alt": "Мед акацієвий",
        "title": "Мед акацієвий натуральний",
        "weight": "0,25 л - 3 л",
        "price": "100 грн - 1000 грн",
        "description": {
          "weights": "0,25 л - 100 грн, 0,5 л - 200 грн, 1 л - 400 грн, 2 л - 700 грн, 3 л - 1000 грн",
          "features": [
            "Кришталево прозорий рідкий світло-золотавого кольору мед з ніжним ароматом білої акації",
            "Нейтральної солодкості, з кислинкою і ніжним ароматом цвітіння білої акації",
            "Антисептична та протибактеріальна дія, нормалізація тиску, розширення судин, зміцнення імунітету, має гіпоалергенні властивості, містить велику концентрацію антиоксидантів",
            "Єдиний сорт меду, який зберігає рідкий стан і не має терміну придатності при правильному зберіганні, також єдиний сорт меду, який має гіпоалергенні властивості."
          ]
        }
      },
      {
        "id": "2",
        "category": "Мед",
        "image": "МедКвітковий-desktop.jpeg",
        "alt": "Мед квітковий",
        "title": "Мед квітковий натуральний",
        "weight": "0,25 л - 3 л",
        "price": "75 грн - 800 грн",
        "description": {
          "weights": "0,25 л - 75 грн, 0,5 л - 150 грн, 1 л - 300 грн, 2 л - 550 грн, 3 л - 800 грн",
          "features": [
            "В’язкий і тягучий насичений ароматний мед світло бурштинового кольору з міксу літніх польових квітів і трав, цвіту липи та акації",
            "Духмяний, з пряним ароматом трав і квітів, з яскравими смаковими нотками, солодкий",
            "Повертає тонус і силу, дарує заряд бадьорості, відновлює енергію після фізичних навантажень, зміцнює імунну систему, нормалізує обмінні процеси, заспокоює нервову систему, прискорює процеси загоєння",
            "Кристалізується за 2-3 місяці, але не втрачає свої поживні властивості."
          ]
        }
      },
      {
        "id": "3",
        "category": "Мед",
        "image": "МедРіпаковий-desktop.jpeg",
        "alt": "Мед ріпаковий",
        "title": "Мед ріпаковий натуральний",
        "weight": "0,25 л - 3 л",
        "price": "50 грн - 550 грн",
        "description": {
          "weights": "0,25 л - 50 грн, 0,5 л - 100 грн, 1 л - 200 грн, 2 л - 350 грн, 3 л - 550 грн",
          "features": [
            "Білуватого кремово-жовтого кольору з витонченим ніжним ароматом та трохи гіркуватим присмаком",
            "Ніжний, витончений з легким гіркуватим післясмаком, середньої солодкості",
            "Містить велику концентрацію антиоксидантів, позитивно впливає на серцево-судинну систему, нормалізує гормональну систему, нормалізує роботу щитовидної залози",
            "Швидко кристалізується — за 4 тижні набуває щільну консистенцію масла з невеликими кристалами жовтого кольору, але від того не втрачає свої корисні властивості. Активно використовується для приготування тортів та випічки, а також в медицині і сфері краси для зовнішнього застосування."
          ]
        }
      },
      {
        "id": "4",
        "category": "Мед",
        "image": "МедСоняшниковий-desktop.jpeg",
        "alt": "Мед соняшниковий",
        "title": "Мед соняшниковий натуральний",
        "weight": "0,25 л - 3 л",
        "price": "60 грн - 600 грн",
        "description": {
          "weights": "0,25 л - 50 грн, 0,5 л - 100 грн, 1 л - 200 грн, 2 л - 350 грн, 3 л - 550 грн",
          "features": [
            "Густий насичений яскраво жовтого гірчичного відтінку найсолодший з усіх сортів меду",
            "Найсолодший з легкого гірчичного з легким польовим ароматом",
            "Поліпшує роботу серцево-судинної системи, сприяє відновленню гормонального стану, зміцнює імунну систему, має заспокійливу дію",
            "Швидко кристалізується — за 4 тижні набуває щільну консистенцію масла з невеликими кристалами жовтого кольору, але від того не втрачає свої корисні властивості. Активно використовується для приготування тортів та випічки, а також в медицині і сфері краси для зовнішнього застосування."
          ]
        }
      },
      {
        "id": "5",
        "category": "Мед з горіхами",
        "image": "ВолозськиГоріхи-desktop.jpeg",
        "alt": "Мед з волоськими горіхами",
        "title": "Мед з волоськими горіхами",
        "weight": "250 мл",
        "price": "200 грн",
        "description": {
          "weights": "250 мл - 200 грн",
          "features": [
            "Ппоживна корисна цілюща суміш, яка миттєво насичує і дарує заряд енергії і бадьорості. ідеальний подарунок тим, кому хочеться подарувати свою турботу і любов. Ця комбінація не залишає байдужим нікого. "
          ]
        }
      },
      {
        "id": "6",
        "category": "Мед з горіхами",
        "image": "ЗМигдалем-desktop.jpeg",
        "alt": "Мед з мигдалем",
        "title": "Мед з мигдалем",
        "weight": "250 мл",
        "price": "200 грн",
        "description": {
          "weights": "250 мл - 200 грн",
          "features": [
            "Ппоживна корисна цілюща суміш, яка миттєво насичує і дарує заряд енергії і бадьорості. ідеальний подарунок тим, кому хочеться подарувати свою турботу і любов. Ця комбінація не залишає байдужим нікого. "
          ]
        }
      },
      {
        "id": "7",
        "category": "Мед з горіхами",
        "image": "ЗЛіщиною-desktop.jpeg",
        "alt": "Мед з ліщиною",
        "title": "Мед з ліщиною",
        "weight": "250 мл",
        "price": "200 грн",
        "description": {
          "weights": "250 мл - 200 грн",
          "features": [
            "Ппоживна корисна цілюща суміш, яка миттєво насичує і дарує заряд енергії і бадьорості. ідеальний подарунок тим, кому хочеться подарувати свою турботу і любов. Ця комбінація не залишає байдужим нікого. "
          ]
        }
      },
      {
        "id": "8",
        "category": "Мед з горіхами",
        "image": "ЗКешю-desktop.jpeg",
        "alt": "Мед з кешью",
        "title": "Мед з кешью",
        "weight": "250 мл",
        "price": "200 грн",
        "description": {
          "weights": "250 мл - 200 грн",
          "features": [
            "Ппоживна корисна цілюща суміш, яка миттєво насичує і дарує заряд енергії і бадьорості. ідеальний подарунок тим, кому хочеться подарувати свою турботу і любов. Ця комбінація не залишає байдужим нікого. "
          ]
        }
      },
      {
        "id": "9",
        "category": "Стільники",
        "image": "Стільник-desktop.jpeg",
        "alt": "Стільники з акацієвим медом",
        "title": "Стільники з акацієвим медом",
        "weight": "100 г",
        "price": "75 грн",
       "description": {
          "weights": "100 г - 75 грн",
          "features": [
            "Мед у стільниках — це мед з вулика практично без обробки. стільники посилюють концентрацію поживних речовин, адже мають багатий склад, який зберігає восковий продукт. Володіють сильною антисептичною, протизапальною та заживлюючою дією."
          ]
        }
      },
      {
        "id": "10",
        "category": "Пилок",
        "image": "Пилок-desktop.jpeg",
        "alt": "Квітковий пилок",
        "title": "Квітковий пилок",
        "weight": "100 г",
        "price": "50 грн",
        "description": {
          "weights": "100 г - 50 грн",
          "features": [
           "Квітковий пилок — це вся палітра вітамінів, мінералів та мікроелементів у великій концентрації зібрана бджолами з польових квітів у вашу ложку.  Рекомендується вживати курсами до 2х тижнів, адже має велику вітамінну одразу діючу концентрацію.  Зміцнює імунітет і насичує організм необхідним запасом вітамінів, мінералів і мікроелементів. "
          ]
        }
      }
  ];

  export const getProductById = (id) => {
    return productsData.find(product => product.id === id);
  };